Repository: 84000/translation-memory-resources
Catalog: post_input/toh287-C.bo.en.tmx
Source language: bo
Languages: en

source: སེམས་ཅན་ མིར་ ནི་ གྱུར་པ་ གང་ །_། ལེགས་པ ར་ བྱས་པ་ མང་ སྤྱད་པ །_ ལས་ ཀྱི་ རྣམ་སྨིན་ དེ་ ཡིས་ སུ །_། ལྷ་ ཡི་ འཇིག་རྟེན་ རབ་ཏུ་ འགེངས །_།
en: $156 “ ‘Human beings Who do much good Will, as their actions ripen, Fill the world of the gods.

source: མི་ ཡི་ མཐུ་ ཡིས་ ལྷ་ འབྱུང་ ལ །_། ལྷ་ ཡི་ མཐུ་ ཡིས་ མི་ འབྱུང་ སྟེ ཕན་ཚུན་ མཐུ ས་ འབྱུང་ འདི་དག་ ནི །_། དམ་པ འི་ ཆོས་ ཀྱི་ ལམ་ དུ་ གནས །_།
en: $157 “ ‘Gods emerge through the power of humans, And humans emerge through the power of gods. This interplay of each other’s powers Is discovered on the path of the sacred Dharma.

source: ལྷ་ ཡི་ བདེ་འགྲོ་ མི་ ཡིན་ ལ །_། མི་ ཡི་ བདེ་འགྲོ་ ལྷ་ ཡིན་ ཏེ །_།
en: $158 “ ‘For gods, the human realms are delightful, And for humans, the divine realms are delightful.

source: ངན་སོང་ གསུམ་ གྱི་ ས་ དག་ ནི །_། དགེ་ [22a] བ འི་ ལས་ རྣམས་ སྤངས་པ་ ཡིན །_།
en: Thus, the three lower realms [22.a] Are relinquished by means of virtue.

source: དེ་ ནི་ ཁྱེད་ ཡིན་ རྟག་ ཏུ་ བརྩོན །_།
en: $159 “ ‘In this you should constantly persevere.

source: ལེགས་པ ར་ མཐོང་བ་ མཆོག་ ཡིན་ ཏེ །_།
en: This is the supreme, excellent vision.#235

source: རྟག་ ཏུ་ ཆོས་ སྤེལ་ བྱེད་པ་ གང་ །_། ལྷ་ མཆོག་ རྣམས་ ནི་ རབ་ཏུ་ འབོད །_།
en: Those who constantly propagate the Dharma Are called upon by the supreme gods.

source: བདེ་བ་ ཐམས་ཅད་ ཆོས་ ལ་ལ ས །_། མྱ་ངན་ འདས་པ་ ཆོས་ ལ་ལ ས །_། གཉིད་ལོག་ རྣམས་ ལ་ ཆོས་སྟོན་ ཅིག _།
en: $160 “ ‘The Dharma brings all joys; The Dharma brings transcendence of suffering. Show the Dharma to those who are asleep.

source: འགྲོ་བ་ མཆོག་ ནི་ ཆོས་ ཡིན་ ནོ །_།
en: The Dharma is the supreme journey.’

source: དེ་སྐད་ ཅེས་ བསྒོ་ ནས་ ལྷ་ རྣམས་ ཀྱི་ དབང་པོ་ བརྒྱ་བྱིན་ འཇིག་རྟེན་ སྐྱོང་བ་ དེ་དག་ ལ་ ཡང་ འདི་སྐད་ དུ་ མི་ རྣམས་ ཡོངས་སུ་ བསྲུང་བ འི་ ཕྱིར་ དང་ །_ ཆོས་ རྣམས་ འཕེལ་བ ར་ བྱ་བ འི་ ཕྱིར་ འབོད་ ཅིག་ ཅེས་ བསྒོའོ །_།
en: $161 “When Śakra, lord of the gods, has given these instructions, he will enjoin the guardians of the world, ‘To protect humans and propagate the Dharma, you must call upon everyone.’

source: དེ་ནས་ ཡང་ དགེ་སློང་ ལས་ ཀྱི་ འབྲས་བུ་ རྣམ་པར་ སྨིན་པ་ ཤེས་པ་ དེས་ ལྷ་ རྣམས་ ཀྱི་ སེམས་ ཀྱི་ རྟོག་པ་ རིག་ ནས་ ནང་ གི་ ཆོས་ ལ་ ཆོས་ ཀྱི་ རྗེས་སུ་ ལྟ་ ཞིང་ གནས་ སོ །_།
en: $162 “When the monk who has knowledge of the effects of the ripening of karmic action has perceived the thoughts of the gods, he will observe and abide by inner phenomena.

source: དེ་ནས་ ཡང་ དགེ་སློང་ ལས་ ཀྱི་ འབྲས་བུ་ རྣམ་པར་ སྨིན་པ་ ཤེས་པ་ དེས་ ལྷ་མ་ ཡིན་ རྣམས་ ཀྱི་ ས་ གཉིས་པ་ ལ་ བརྟགས་ ནས །_ ས་ གསུམ་པ་ ལ་ རྟོག་པ ར་ བྱེད་ དེ །_
en: $163 “When the monk who has knowledge of the effects of the ripening of karmic action has considered the second level of the asuras, he will proceed to examine the third.

source: ལྷ་མ་ ཡིན་ རྣམས་ ཀྱི་ ས་ གསུམ་པ འི་ རྣམ་པ་ ཇི་ལྟ་བུ་ ཡིན་ སྙམ་ ནས །_
en: In this regard, he wonders, ‘What might the third level of the asuras be like?’

source: དེས་ ཐོས་པ་ ལས་ བྱུང་བ འི་ ཤེས་པ ས་ བརྟགས་ ན །_ ས་གཞི་ གསུམ་པ་ གང་ཡིན་ པ་ ནི་ དཔག་ཚད་ ཉི་ཁྲི་ ཆིག་སྟོང་ ཡོད་ དོ །_།
en: Examining this matter with knowledge derived from hearing, he will perceive the third ground that extends across twenty-one thousand leagues.

source: ས་གཞི་ དེ་ཡང་ གནས་ བཟང་པོ་ ཞེས་ བྱ་ སྟེ །_ ཚལ་ དང་ །_ ནགས་ཚལ་ དང་ །_ ལྟེང་ཀ་ དང་ །_ འབབ་ཆུ འི་ དངོ་ དང་ །_ སྐྱེ་བོ་ འཐུན་པ་ སྣ་ཚོགས་ ཀྱིས་ གང་བ །_ རྟག་ ཏུ་ སྤྲོ་བ་ དང་ །_ རོལ་མོ འི་ སྒྲ་སྙན་ པས་ གང་ ངོ་ །_།
en: Known as Excellent Abode, this land features groves, forests, pools, and springs and is full of individuals living in harmony, perpetually happy, and enjoying the sounds of music.

source: གྲོང་ཁྱེར་ ཟབ་པ་ ཞེས་ བྱ་བ་ དཔག་ཚད་ བརྒྱད་ སྟོང་པ་ ཡོད་ དེ །_ གྲོང་ཁྱེར་ དེ་ ན་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ མེ་ཏོག་ ཕྲེང་ ཞེས་ བྱ་བ་ གནས་ སོ །_།
en: Within it lies the city known as Profound. This city covers eight thousand leagues and is the residence of the asura ruler known as Puṣpamāla.

source: ལྷ་མ་ ཡིན་ དེ་ རྣམས་ ཀྱང་ རྩེ་བ་ ལ་ གནས་པ་ ཞེས་ བྱ་ ལ །_
en: The asuras there are known as the players.

source: གྲོང་ཁྱེར་ ཟབ་པ་ དེ་ཡང་ རིན་པོ་ཆེ འི་ རྣམ་པ་ དུ་མ་ དང་ །_ ཚལ་ དང་ །_ ནགས་ཚལ་ དང་ །_ ལྟེང་ཀ་ དང་ །_ པད་མ འི་ རྫིང་ རབ་ཏུ་ མང་པོ་ དང་ ལྡན་པ །_
en: The city of Profound has numerous jewels, groves, forests, ponds, and lotus pools.

source: འདམ་ དང་ རྙོག་པ་ དང་ བྲལ་བ འི་ པད་མ་ སྐྱེ་བ འི་ རྫིང་ རྣམས་ ཀྱིས་ མཛེས་པ ར་ བྱས་པ་ ལྷ་མ་ ཡིན་ རྩེ་བ འི་ གྲོགས་པོ་ དང་ ལྡན་པ་ རྣམས་ ཀྱིས་ ཀུན་ ནས་ ཡོངས་སུ་ བསྐོར་བ །_
en: The player asuras spend their time hanging out with their friends around the beautiful pools that are abloom with lotuses free from mud and dirt.

source: དུས་ཚིགས་ དྲུག་ ཉམས་ དགའ་བ །_ ཚལ་ ཆེན་པོ་ བཞི་ རྣམས་ ཀྱིས་ མཛེས་པ ར་ བྱས་པ་ ལ་ འདི་ལྟ་སྟེ །_
en: All six seasons are delightful, and the land is adorned with four great forests.

source: དྲིལ་བུ་ གཡེར་ཁ འི་ ཕྲེང་བ འི་ ཚལ་ ཞེས་ བྱ་བ །_ གང་ དུ་ དྲིལ་བུ་ གཡེར་ཁ འི་ ཤིང་ ལྗོན་པ་ རྟག་ ཏུ་ སྒྲ་དབྱངས་ སྙན་པ་ འབྱིན་པ་ [22b] དང་ །_
en: In the forest known as Garland of Bell Bangles, one constantly hears the melodious sounds of trees filled with bangles with bells; [22.b]

source: འདི་ལྟར་ ཚལ་ གཉིས་པ་ གསེར་ ཕྲེང་ ཞེས་ བྱ་བ་ གང་ དུ་ གསེར་ གྱི་ ཤིང་ ལྗོན་པ་ སྐྱེ་བ་ དང་ །_
en: in the second forest, known as Golden Garland, grow trees of gold;

source: ཚལ་ གསུམ་པ་ མེ་ ཕྲེང་ ཞེས་ བྱ་བ་ གང་ དུ་ མེ་ ལྟ་བུ འི་ ཤིང་ ལྗོན་པ་ འབྲས་བུ་ དམར་པོ་ འབྱུང་བ་ དང་ །_
en: in the third forest, known as Fire Garland, grow fire-like trees that yield red fruits;

source: ཚལ་ བཞི་པ་ འདྲེས་པ་ ཞེས་ བྱ་བ་ གང་ དུ་ མེ་ཏོག་ དང་ འབྲས་བུ་ འདྲེས་པ་ རྣམས་ ཀྱིས་ མཛེས་པ ར་ བྱས་པ་ ཡིན་ ཏེ
en: and in the fourth forest, known as Mixture, grow a blend of beautiful flowers and fruits.

source: ཚལ་ བཞི་པོ་ དེ་ རྣམས་ ཀྱིས་ ལྷ་མ་ ཡིན་ གྱི་ གྲོང་ཁྱེར་ ཟབ་པ་ མཛེས་པ ར་ བྱས་ སོ །_།
en: Those four forests adorn the city of Profound.

source: གང་ ན་ ལྷ་མ་ ཡིན་ རྩེ་བ འི་ གྲོགས་ དང་ ལྷན་ཅིག་ གནས་པ་ ནི་ ལྷ་ དང་ འཐུན་ པར་ བདེ་བ ར་ གནས་པ་ ཡིན་ ཏེ །_
en: When the player asuras thus have a good time with their friends, their happiness is like that of the gods.

source: དེ་ལྟ ར་ གནས་པ་ དེ་དག་ ནི་ མེ་ཏོག་ ཕྲེང་ དང་ །_ ཕྱེ་མ་ དང་ །_ བྱུག་པ་ རྣམས་ ཀྱིས་ ལུས་ བརྒྱན་པ །_ སྤྲོ་བ་ དང་ །_ དགའ་བ་ དང་ །_ རྩེ་བ་ དང་ །_ རྒལ་བ་ དང་ །_ དགོད་པ་ རྣམས་ ཀྱིས་ རྟག་ ཏུ་ གནས་པ །_
en: Adorning their bodies with flower garlands, powders, and ointments, they always have fun, enjoy themselves, play, sport, and joke.

source: ལྷ་མ་ ཡིན་ གྱི་ བུ་མོ་ འབུམ་ སྙེད་ ཀྱིས་ ཡོངས་སུ་ བསྐོར་བ །_ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ མེ་ཏོག་ ཕྲེང་ གིས་ བསྐྱངས་པ །_
en: Surrounded by a hundred thousand asurīs, the asura king Puṣpamāla sustains the land.

source: སྐྱེད་མོས་ཚལ་ དུ་ རྟག་ ཏུ་ རྩེ་བ ར་ གནས་པ །_ ལུས་ ཀྱི་ བར་བར་ ནི་ རིན་པོ་ཆེ་ རྣམ་པ་ སྣ་ཚོགས་ ཀྱིས་ བརྒྱན་པ་ ཡིན་ ཏེ
en: He always plays around in the parks and he wears various jewel ornaments around his waist.

source: ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ བརྟན་པ ས་ གནས་ གཉིས་པ་ ན་ གནས་པ །_ ལྷ་མ་ ཡིན་ འཛམ་ བྷ་ ཞེས་ བྱ་བ །_ ལྷ་མ་ ཡིན་ མེ་ཏོག་ ཕྲེང་ ཞེས་ བྱ་བ འི་ དྲུང་ དུ་ མངགས་ ཏེ །_
en: $164 “The asura king Firm, who lives on the second level, will send an asura called Jambha to go before the asura Puṣpamāla.

source: འདི་ལྟར་ མི འི་ འཇིག་རྟེན་ ན་ མི་ འདི་དག་ ཐམས་ཅད་ མར་ འཛིན་པ་ དང་ །_ ཕ ར་ འཛིན་པ་ དང་ །_ དགེ་སྦྱོང་ དུ་ འཛིན་པ་ དང་ །_ བྲམ་ཟེ ར་ འཛིན་པ་ དང་ །_ བྱས་པ་ ལ་ ཕན་ འདོགས་པ་ ཡིན་ ལ །_
en: Jambha will say, ‘In the world of humans everyone respects their mothers, their fathers, mendicants, and brahmins, and they repay the kindness of others.

source: དེ་ལྟ ར་ གནས་པ་ དེ་དག་ ནི་ མི་ མཐུ་ ཆེ་བ་ རྣམས་ ཀྱིས་ ལྷ་ རྣམས་ མཐུ་ ཆེ་བ་ ཡིན་ ཏེ
en: Living in that way, those powerful humans make the gods powerful as well.

source: དེས་ན་ བདག་ཅག་ དང་ ཀླུ་ དང་ བཅས་པ་ རྣམས་ ཀྱིས་ ངེས་པ ར་ ལྷ་ དང་ མི་ རྣམས་ ཀྱི་ དམ་པ འི་ ཆོས་ ཀྱི་ བར་ཆད་ བྱ་བ་ ལ་ འབད་པ ར་ བྱ འོ་
en: We and the nāgas must therefore by all means endeavor to create obstacles for the sacred Dharma of gods and humans.’

source: ཞེས་ སྔ་མ་ བཞིན་ དུ་ དེ་དག་ ཐོས་ ནས གནས་ གསུམ་པ་ ན་ གནས་པ་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ མེ་ཏོག་ ཕྲེང་ ཤིན་ཏུ་ མི་ དགའ་ སྟེ །_
en: $165 “When Puṣpamāla, king of the third level of the asuras, thus hears the same message as before, he will become extremely upset and declare,

source: བདག་ཅག་ གི་ དགྲ་བོ་ ལྷ་ འདི་དག་ ནི་ མི་ལ་ རག་ ལས་པ་ ཡིན་པ ས །_ ལྷ་ དང་ མི འི་ བར་ཆད་ བྱ འོ་ ཞེས་ སྨྲས་ སོ །_།
en: ‘The gods are our enemies and the gods depend on humans. We shall therefore create obstacles for both the gods and humans!’

source: དེ་ནས་ ལྷ་མ་ ཡིན་ རྩེ་ ཞིང་ གནས་པ་ མཚོན་ དང་ གོ་ཆ་ སྣ་ཚོགས་ ཀྱིས་ ལུས་ རྣམ་པར་ བརྒྱན་པ །_ ཤིན་ཏུ་ ཆས་པ་ རྣམས་ ཀླུ་ རྣམས་ ཀྱི་ གནས་ ལོངས་སྤྱོད་ ལྡན་ ག་ལ་བ་ དེར་ དོང་ ངོ་ །_།
en: $166 “The player asuras will at that point brandish their various weapons and don their armor, and will strike out toward the wealthy abodes of the nāgas.

source: དེ་ནས་ ལྷ་མ་ ཡིན་ གྱི་ སྒྲ་ དེ་དག་ ཐོས་ ནས་ ཀླུ འི་ རྒྱལ་པོ་ ཆེན་པོ་ ནོར་ རྒྱས་ ཀྱི་ བུ་ དང་ །_ འཇོག་པོ་ ལ་སོགས་པ་ ལུས་ ལ་ གློག་ གི་ ཕྲེང་བ་ [23a] འབར་བ་ འབྱུང་བ །_
en: When they hear the noises of the asuras, the great nāga gods, such as Vāsuki and Takṣaka, will emit beams of light from their bodies. [23.a]

source: ཤིན་ཏུ་ ཆས་པ་ རྣམས་ གློག་ མང་པོ་ ཆར་ ལྟར་ འབྱིན་པ་ ན་ རྒྱ་མཚོ འི་ དབུས་ ནས་ ཀླུ་འབུམ་ ཕྲག་ བྱེ་བ་ དུ་མ་ དག་ མངོན་པར་ འབྱུང་ ངོ་ །_། དེ་ནས་ ལྷ་མ་ ཡིན་ དེ་ རྣམས་ དང་ །_ ཀླུ་ དེ་ རྣམས་ རྒྱ་མཚོ འི་ དབུས་ སུ་ གཡུལ་ ཆེན་པོ་ འགྱེད་པ ར་ འགྱུར་ ཏེ །_
en: Sending forth a great shower of lightning, an army of millions of nāgas will advance toward the center of the ocean where they will meet the asuras in a gigantic battle.

source: དེ་ གང་ གི་ ཚེ་ ཆོས་ དང་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ འཇུག་པ འི་ མི་ འབྱུང་བ་ དེ འི་ ཚེ་ལྷ་མ་ ཡིན་ རྣམས་ ཕམ་པ ར་ འགྱུར་ ལ །_ གལ་ཏེ་ ཆོས་ དང་ མི་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ མི་ འཇུག་པ འི་ སྐྱེ་དགུ་ འབྱུང་ ན་ སྔ་མ་ བཞིན་ དེ འི་ ཚེ་ལྷ་མ་ ཡིན་ གྱི་ ཕྱོགས་ རྒྱལ་བ ར་ འགྱུར་ ཏེ ཀླུ འི་ ཕྱོགས་ ཕམ་པ ར་ འགྱུར་ རོ །_། དེ་ལྟ ར་ ཐམས་ཅད་ ཆོས་ ལ་ རག་ ལས་པ་ ཡིན་ ཏེ །_
en: As before, if at that time humans are righteous and follow the Dharma, the asuras will suffer defeat, but if people are unrighteous and do not follow the Dharma, the asuras will be victorious and the nāgas will suffer defeat. Thus, everything depends on the Dharma.

source: དེ་ གང་ གི་ ཚེ་ ཀླུ་ ཕམ་པ ར་ གྱུར་ ན །_ དེ་དག་ ཀུན་ ཏུ་ རྒྱུ་བ འི་ ལྷ་ རྣམས་ ལ་
en: $167 “If the nāgas lose, they will say to the wandering gods,

source: ཀྱེ་ གྲོགས་པོ་ དག་ འདི་ལྟར་ ལྷ་མ་ ཡིན་ རྣམས་ ཀྱི་ མཐུ་ ལ་ བགེགས་ བྱ་བ འི་ ཕྱིར་ འབོད་ ཅིག་ ཅེས་ སྨྲས་ སོ །_།
en: ‘O friends, call upon everyone to stop the power of the asuras!’

source: དེ་ནས་ ཀུན་ ཏུ་ རྒྱུ་བ འི་ ལྷ་ ཁྲོ་བ ས་ གདུངས་པ་ རྣམས་ ཁ་ རླངས་ འབྱིན་ བཞིན་ དུ་ རྒྱལ་ཆེན་ བཞི འི་ ལྷ་ རྣམས་ ལ །_
en: Breathing with fury, the wandering gods will then tell the gods of the Four Great Kings,

source: ཀྱེ་ ལྷ་ དག་ འདི་ལྟར་ ལྷ་མ་ ཡིན་ གྱི་ ཕྱོགས་ འདི་ ནི་ མཐུ་ ཆེ་ སྟེ ཀླུ་ རྣམས་ ནི་ ཕམ་ མོ །_།
en: ‘Ah, gods, the battalions of the asuras are strong and have defeated the nāgas.

source: ལྷ་མ་ ཡིན་ རྣམས་ ནི་ རྒྱལ་ གྱིས་ གཡུལ་ བཤམ་པ་ ལ་ རབ་ཏུ་ འབོད་ ཅིག་ ཅེས་ སྨྲས་ སོ །_།
en: Call on everyone to mobilize so that we may defeat the asuras.’

source: ཀུན་ ཏུ་ རྒྱུ་བ འི་ ལྷ འི་ བུ་ དེ་དག་ དང་ །_ ཁ་ རླངས་ དེ་ མཐོང་ ནས་ ཀྱང་ རྟོག་གེ་པ་ དག་ ན་རེ །_
en: $168 “When sophists see the breath of the wandering divine sons, they will say,

source: འདི་ལྟར་ དུ་བ་ མཇུག་ རིངས་ བྱུང་ སྟེ །_
en: ‘The comet Ketu has arrived!’

source: ཆར་ ལེགས་པ ར་ འབབ་པ ར་ མི་ འགྱུར་ རོ་ ཞེས་ སྔ་མ་ བཞིན་ དུ་ སྦྱར་ ཏེ །_
en: ‘No rain will fall!’ and so on, just like before.

source: འདི་ ནི་ དུ་བ་ མཇུག་ རིངས་ སྟོན་པ འི་ རྒྱུ་གཉིས་པ་ ཡིན་ ནོ །_།
en: This, then, is the second reason for the appearance of a comet.

source: དེ་ གང་ གི་ ཚེ་ ལྷ་ དང་ །_ ཀླུ་ དང་ །_ གནོད་སྦྱིན་ དག་ རྒྱལ་བ ར་ འགྱུར་བ་ དེ འི་ ཚེ །_ ཆར་ ལེགས་པ ར་ འབབ་ ཅིང་ ལོ་ལེགས་ པར་ འགྱུར །_། དེ འི་ ཚེ་ ནད་ འབྱུང་བ ར་ མི་ འགྱུར་ ཞིང་ །_ མཚོན་ གྱིས་ འཁྲུག་པ ར་ མི་འགྱུར་བ་ དང་ །_
en: $169 “When the gods, nāgas, and yakṣas are victorious, there will be timely rain and excellent harvests, and there will be neither plagues nor wars.

source: འདི་ལྟ་སྟེ །_ རྟོག་གེ་པ་ དག་ ན་རེ་ འདི་ལྟར་ གཟས་ ཆར་ ཕབ་བོ་ ཞེས་ བྱ་བ་ ལ་སོགས་པ་ རྒྱ་ ཆེ ར་ སྦྱར་ རོ །_།
en: However, when sophists see such circumstances, they will go on at length about the rain being caused by planets and the like.

source: དེ་ནས་ གང་ གི་ ཚེ་ ཆོས་ དང་ མི་ ལྡན་ ཞིང་ ཆོས་ ཀྱི་ རྗེས་སུ་ མི་ འཇུག་པ འི་ སྐྱེ་དགུ་ འབྱུང་ ཞིང་ མར་ མི་ འཛིན་པ་ དང་ །_ ཕ ར་ མི་ འཛིན་པ་ དང་ །_ རྒན་རབས་ ལ་ གུས་པ ར་ མི་ བྱེད་པ་ དེ འི་ ཚེ །_ ལྷ་མ་ ཡིན་ གྱི་ ཕྱོགས་ ནི་ རྒྱལ་བ ར་ འགྱུར་ ཏེ
en: $170 “Now, if at that time people are unrighteous and do not follow the Dharma, if they do not respect their mothers and fathers, and if they are not devoted to their elders, then the asuras will be victorious.

source: ཆར་ མི་ འབབ་ ཅིང་ ཆོས་ དང་ མི་ ལྡན་པ་ རྣམས་ ཀྱིས་ ལོ་ལེགས་ པར་ མི་ འགྱུར་ ལ །_ [23b] མཚོན་ གྱིས་ འཁྲུག་པ ར་ ཡང་ འགྱུར་ རོ །_།
en: In that case there will be no rain, harvests will be destroyed by those who are unrighteous, [23.b] and warfare will ensue.

source: དེ་ ལ་ རྟོག་གེ་པ་ དག་ གཞན་ དུ་ སྒྱུར་ ཏེ །_ གཟ འི་ ཉེས་པ ས་ ཆར་ མི་ འབབ་བོ །_། རྒྱུ་སྐར་ གྱི་ ཉེས་པ ས་ ལོ་ལེགས་ པར་ མི་ འགྱུར་ རོ་ ཞེས་ སྔ་མ་ བཞིན་ དུ་ སྦྱར་ ཏེ །_
en: Sophists, however, will construe those events differently, blaming the lack of rain on the planets, the failed harvests on the celestial bodies, and so on, as mentioned before.

source: དེ་ལྟ ར་ ཆོས་ དང་ ཆོས་མ་ ཡིན་པ་ མངོན་པར་ མི་ ཤེས་པ་ རྟོག་གེ་པ་ དག་ གཞན་ དུ་ སྒྱུར་ ཞིང་ འཇིག་རྟེན་པ་ ལ་ གཞན་ དུ་ སྒྲོགས་ སོ །_།
en: In this way, sophists who cannot distinguish truth from error will construe things wrongly and spread their ideas among the people of the world.

source: དེ་ལྟ ར་ མི་ ཤེས་པ ས་ ཉམས་པ་ ཐམས་ཅད་ ནི་ མུ་སྟེགས་ ཡ་མཚན་ གྱི་ བློ ར་ འགྱུར་ རོ །_།
en: All who suffer from ignorance will then be impressed by these non-Buddhists.

source: གང་ གི་ ཚེ་ལྷ་མ་ ཡིན་ རྣམས་ ཀྱིས་ ཀླུ་ རྣམས་ ཟིལ་ གྱིས་ མནན་པ་ དེ འི་ ཚེ །_ དེ་ནས་ ཡང་ འཇིག་རྟེན་ སྐྱོང་བ་ བཞི་ དག་ རྒྱལ་ཆེན་ བཞི་པ་ རྣམས་ ལ་ འདི་ལྟར་ སྒྲ་ སྒྲོགས་ པར་ བྱེད་ དེ
en: $171 “When the asuras subjugate the nāgas, the four guardians of the world will call out to the gods of the Four Great Kings with the following words:

source: ཆོས་ལུགས་ རྒྱལ་བ ར་ གྱུར་ཅིག་ ཆོས་ མིན་ རྒྱལ་མ་ གྱུར །_།
en: “ ‘Let the ways of Dharma prevail, not the ways of non-Dharma!

source: བདེན་པ་ རྒྱལ་བ ར་ གྱུར་ཅིག་ བརྫུན་པ་ རྒྱལ་མ་ གྱུར །_།
en: Let the truth prevail, not falsehood!

source: ལྷ་ རྣམས་ རྒྱལ་བ ར་ གྱུར་ཅིག་ ལྷ་མིན་ རྒྱལ་མ་ གྱུར །_།
en: Let gods prevail, not asuras!

source: སྣང་བ་ རྒྱལ་བ ར་ གྱུར་ཅིག་ མུན་པ་ རྒྱལ་མ་ གྱུར །_།
en: Let light prevail, not darkness!

source: སྦྱིན་པ་ རྒྱལ་བ ར་ གྱུར་ཅིག་ འཇུངས་པ་ རྒྱལ་མ་ གྱུར །_།
en: $172 “ ‘Let generosity prevail, not miserliness!

source: ཚུལ་ཁྲིམས་ རྒྱལ་བ ར་ གྱུར་ཅིག་ གསོད་པ་ རྒྱལ་མ་ གྱུར །_།
en: Let discipline prevail, not murder!

source: སངས་རྒྱས་ རྒྱལ་བ ར་ གྱུར་ཅིག་ མུ་སྟེགས་ རྒྱལ་མ་ གྱུར །_།
en: Let buddhas prevail, not non-Buddhists!

source: བརྟན་པ་ རྒྱལ་བ ར་ གྱུར་ཅིག་ གཡོ་བ་ རྒྱལ་མ་ གྱུར །_།
en: Let the steadfast prevail, not the crooked!

source: ཆོས་བཞིན་ རྒྱལ་བ ར་ གྱུར་ཅིག་ དོར་ སྒྱུ་ རྒྱལ་མ་ གྱུར །_།
en: $173 “ ‘Let what is wholesome prevail, not what should be discarded!

source: སྙིང་རྗེ་ རྒྱལ་བ ར་ གྱུར་ཅིག་ བརྩེ་ མེད་ རྒྱལ་མ་ གྱུར །_།
en: Let compassion prevail, not cold-heartedness!

source: བྱམས་པ་ རྒྱལ་བ ར་ གྱུར་ཅིག་ ཁྲོ་བ་ རྒྱལ་མ་ གྱུར །_།
en: Let love prevail, not anger!

source: བརྒྱ་བྱིན་ རྒྱལ་བ ར་ གྱུར་ཅིག་ ལྷ་མིན་ རྒྱལ་མ་ གྱུར །_།
en: Let Śakra prevail, not an asura!

source: གོང་མ་ རྒྱལ་བ ར་ གྱུར་ཅིག་ འོག་མ་ རྒྱལ་མ་ གྱུར །_།
en: $174 “ ‘Let the superior prevail, not the inferior!

source: འགྲངས་པ་ རྒྱལ་བ ར་ གྱུར་ཅིག་ བཀྲེས་པ་ རྒྱལ་མ་ གྱུར །_།
en: Let full stomachs prevail, not starvation!

source: ཡེ་ཤེས་ རྒྱལ་བ ར་ གྱུར་ཅིག་ གཏི་མུག་ རྒྱལ་མ་ གྱུར །_།
en: Let wakefulness prevail, not dullness!

source: བྱ་བ་ རྒྱལ་བ ར་ གྱུར་ཅིག་ བྱ་ མིན་ རྒྱལ་མ་ གྱུར །_།
en: Let the proper prevail, not the improper!

source: བརྩོན་འགྲུས་ རྒྱལ་བ ར་ གྱུར་ཅིག་ ལེ་ལོ་ རྒྱལ་མ་ གྱུར །_།
en: $175 “ ‘Let diligence prevail, not laziness!

source: སྐྱེས་པ་ རྒྱལ་བ ར་ གྱུར་ཅིག་ བུད་མེད་ རྒྱལ་མ་ གྱུར །_།
en: Let men prevail, not women!

source: རྒན་རབས་ རྒྱལ་བ ར་ གྱུར་ཅིག་ བྱིས་པ་ རྒྱལ་མ་ གྱུར །_།
en: Let elders prevail, not infants!

source: བཟོད་པ་ རྒྱལ་བ ར་ གྱུར་ཅིག་ སྡང་བ་ རྒྱལ་མ་ གྱུར །_།
en: Let patience prevail, not anger!

source: མི་ རྣམས་ རྒྱལ་བ ར་ གྱུར་ཅིག་ རབ་ འཇོམས་ ལ་སོགས་པ །_།
en: $176 “ ‘Let humans prevail,

source: ཕུང་བ ར་ བྱེད་པ འི་ ཀླུ་ རྣམས་ རྒྱལ་བ ར་ མ་ གྱུར་ཅིག _།
en: Not ruinous nāgas such as Pramatha!

source: ཉིན་ མོ་ རྒྱལ་བ ར་ གྱུར་ཅིག་ མཚན་མོ་ རྒྱལ་མ་ གྱུར །_།
en: Let day prevail, not night!

source: ཟླ་བ་ རྒྱལ་བ ར་ གྱུར་ཅིག་ གཟའ་ རྣམས་ རྒྱལ་མ་ གྱུར །_།
en: Let the moon prevail, not the planets!

source: ལོ་ཏོག་ རྒྱལ་བ ར་ གྱུར་ཅིག་ རྩིགས་ མ་ རྒྱལ་མ་ གྱུར །_།
en: $177 “ ‘Let crops prevail, not husks!#236

source: བདེ་བ་ རྒྱལ་བ ར་ གྱུར་ཅིག་ [24a] བདེ་མིན་ རྒྱལ་མ་ གྱུར །_།
en: Let happiness prevail, not unhappiness! [24.a]

source: ནད་མེད་ རྒྱལ་བ ར་ གྱུར་ཅིག་ ནད་ རྣམས་ རྒྱ་ལམ་ གྱུར །_།
en: Let health prevail, not disease!

source: འཇམ་པོ་ རྒྱལ་བ ར་ གྱུར་ཅིག་ རྩུབ་པོ་ རྒྱལ་མ་ གྱུར །_།
en: Let the gentle prevail, not the harsh!

source: ཐར་པ་ རྒྱལ་བ ར་ གྱུར་ཅིག་ བཅིངས་པ་ རྒྱལ་མ་ གྱུར །_།
en: $178 “ ‘Let freedom prevail, not bondage!

source: གཞུང་ལུགས་ རྒྱལ་བ ར་ གྱུར་ཅིག་ ལུགས་ མིན་ རྒྱལ་མ་ གྱུར །_།
en: Let scriptural traditions prevail, not that which lacks tradition!

source: གཅེས་པ་ རྣམས་ ནི་ ཐམས་ཅད་ རབ་ཏུ་ རྒྱལ་བ ར་ ཤོག _།
en: May all those whom we cherish prevail,

source: གཅེས་ མིན་ དག་ ནི་ དུས་ རྣམས་ ཀུན་ ཏུ་ བཅོམ་པ ར་ ཤོག _།
en: And may those whom we do not cherish suffer defeat!’

source: དེ་ལྟ ར་ འཇིག་རྟེན་ སྐྱོང་བ་ བཞི་ དག་ རྔ་བོ་ ཆེ་ ཐོགས་ ནས་ ལྷ་ རྣམས་ ལ་ རྒྱུགས་ ཤིག་ རྒྱུགས་ ཤིག་ ཅེས་ སྨྲས་ སོ །_།
en: $179 “Thus, striking great drums, the four guardians of the world will call to the gods, ‘Let’s go! Let’s go!’

source: དེ་ནས་ ལྷ་ རྣམས་ དེ་དག་ གིས་ སྨྲས་པ་ ཐོས་ ནས་ མཚོན་ཆ་ དང་ གོ་ཆ་ སྣ་ཚོགས་ བགོས་ ཏེ །_ ཀླུ་ རྣམས་ དང་ །_ ལྷ་མ་ ཡིན་ རྣམས་ ལྷན་ཅིག་ གཡུལ་འགྱེད་ པར་ མིག་ བཙུམས་པ་ ཙམ་ གྱི་ ཚད་ དུ་ དེར་ ཐམས་ཅད་ ཕྱིན་ ཏོ །_།
en: When the gods hear their words, they will arm themselves with weapons and chain mail, and, in the wink of an eye, proceed to face the nāgas and asuras to meet them in battle.

source: དེ་ནས་ ལྷ་མ་ ཡིན་ རྣམས་ ཀྱིས་ དེ་དག་ ལ་ བརྟགས་ ནས །_
en: The asuras will then take stock of the army of gods.

source: འདི་ལྟར་ དགེ་སྦྱོང་ དུ་ འཛིན་པ་ དང་ །_ བྲམ་ཟེ ར་ འཛིན་པ འི་ སྐྱེ་དགུ་ འབྱུང་བ་ སྔ་མ་ བཞིན་ སྦྱར་ ཏེ །_ དེ འི་ ཚེ་ལྷ་མ་ ཡིན་ རྣམས་ ཀྱིས་ ལྷ་ དེ་དག་ མཐོང་ ནས །_ ས འི་ འོག་ གཞན་ ག་ལ་ བར་ ཐམས་ཅད་ དུ་ འཇུག་པ ར་ བྱེད་ དོ །_།
en: If at that time people respect mendicants, respect brahmins, and so on, the sight of the gods will cause the asuras to retreat below the ground.

source: གལ་ཏེ་ དགེ་སྦྱོང་ དུ་ མི་ འཛིན་པ་ དང་ །_ བྲམ་ཟེ ར་ མི་ འཛིན་པ འི་ སྐྱེ་དགུ་ འབྱུང་ ན །_ ལྷ་ རྣམས་ དང་ དེ་དག་ ལྷན་ཅིག་ གཡུལ་འགྱེད་ པར་ ཤོམ་ སྟེ །_
en: If, however, people do not respect mendicants and brahmins, the asuras will prepare to do battle with the gods.

source: དེ་དག་ ཡུད་ཙམ་ ཞིག་ གཡུལ་ བཀྱེ་ ནས་ ལྷ་ རྣམས་ ཀྱིས་ ཕམ་པ ར་ བྱས་ ནས །_ དེ་ནས་ ཡང་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ མེ་ཏོག་ ཕྲེང་ དང་ །_ ལྷ་མ་ ཡིན་ ཕམ་པ་ རྣམས་ དང་ ལྷན་ཅིག་ རང་རང་ གི་ གནས་ སུ་ འཇུག་པ་ མཐོང་ ངོ་ །_།
en: Nevertheless, after just a moment of fighting, the gods will defeat the asuras, and thus King Puṣpamāla and his defeated asuras will return to their respective places.

source: དེ་ནས་ ཡང་ དགེ་སློང་ ལས་ ཀྱི་ འབྲས་བུ་ རྣམ་པར་ སྨིན་པ་ ཤེས་པ་ དེས་ ལྷ་ དང་ ལྷ་མ་ ཡིན་ གྱི་ གཡུལ་ མཐོང་ ནས །_ ཡང་དག་པ་ ཇི་ལྟ་ བ་ བཞིན་ ཆོས་ ལ་ ཆོས་ ཀྱི་ རྗེས་སུ་ ལྟ་ ཞིང་ གནས་ སོ །_།
en: $180 “When the monk who has knowledge of the effects of the ripening of karmic actions sees the battle between the gods and the asuras, he will correctly abide by the observation of inner phenomena.#237

source: དེ་ནས་ ཡང་ དགེ་སློང་ ལས་ ཀྱི་ འབྲས་བུ་ རྣམ་པར་ སྨིན་པ་ ཤེས་པ་ དེ་ གནས་ གསུམ་པ་ ལ་ གནས་པ་ ཞེས་ བྱ་བ འི་ ལྷ་མ་ ཡིན་ མེ་ཏོག་ ཕྲེང་ ཞེས་ བྱ་བ་ ལ་སོགས་པ འི་ ལས་ ཀྱི་ ཆོས་ ཀྱི་ རྣམ་པར་ སྨིན་པ་ ལ་ རྟོག་པ ར་ བྱེད་
en: $181 “Next, the monk who has knowledge of the effects of the ripening of karmic actions will examine the ripening of karmic qualities associated with the third level of the asuras, to which the asura Puṣpamāla belongs.

source: དེ་ལས་ ཀྱི་ ཆོས་ ཀྱི་ རྣམ་པར་ སྨིན་པ་ གང་ གིས་ ལྷ་མ་ ཡིན་ གནས་ གསུམ་པ་ གནས་ བཟང་ དུ་ སྐྱེ་བ ར་ འགྱུར་ སྙམ་ ནས །_
en: In this regard, he will wonder, ‘What ripening of karmic qualities will cause birth in Excellent Abode, the third level of the asuras?’

source: དེས་ ཐོས་པ་ ལས་ བྱུང་བ འི་ ཤེས་པ ས་ བརྟགས་ ན །_ གང་ གིས་ དུས་ སུ་ སྦྱོར་བ འི་ དོན་ དུ་ གྱད་ དམ །_ སིལ་ཁྲོལ་བ འམ །_ དུ་ གུལ་ ལ་ ཀ་བ འམ །_ བསྡུས་ [24b] པ འམ །_ དགའ་ འདུན་པ ར་ གྱུར་པ་ དག་ ལ་ སྦྱིན་པ་ ངན་པ་ བྱིན་པ་ དེ་ སེམས་པ་ དང་ མི་ ལྡན་ ཞིང་ །_
en: $182 “As he inquires with knowledge derived from hearing, he will notice how some people, for the sake of a seasonal festival,#238 offer improper gifts to members of the saṅgha,#239 such as athletes, music,#240 or food offerings, [24.b] thus giving inattentively toward improper recipients.

source: ཞིང་བཟང་པོ་ མ་ཡིན་པ་ ལ་ བྱིན་པ་ དེ་ ལུས་ དང་ བྲལ་ ནས་ ངན་འགྲོ་ ལོག་པ ར་ ལྟུང་བ་ གནས་ གསུམ་པ་ ན་ གནས་པ འི་ ལྷ་མ་ ཡིན་ རྣམས་ ཀྱི་ ནང་ དུ་ སྐྱེ་བ ར་ འགྱུར་ རོ །_།
en: When such people later separate from their bodies, they will fall into the lower realms and be born among the asuras of the third level.

source: དེ་དག་ ནི་ མི་ རྣམས་ ཀྱི་ ལོ་ བདུན་ བརྒྱ་ གང་ཡིན་པ་ དེ་དག་ གི་ ཉིན་ཞག་ གཅིག་ ཡིན་ ལ །_ བགྲང་བ་ དེ་ ཡི་ ལོ་ བདུན་ སྟོང་ ཐུབ་ སྟེ །_
en: Seven hundred human years constitute one day and night in the lives of those asuras and they may live for seven thousand of their own years.

source: དུས་ མ་ཡིན་པ ར་ འཆི་བ་ ནི་ ཡོད་པར་ མཐོང་ ངོ་ །_།
en: However, they could also die prematurely.

source: དེ་ནས་ ཡང་ དགེ་སློང་ ལས་ ཀྱི་ འབྲས་བུ་ རྣམ་པར་ སྨིན་པ་ ཤེས་པ་ དེ །_ ལྷ་མ་ ཡིན་ གྱི་ བདག་པོ་ མེ་ཏོག་ ཕྲེང་ གི་ ལས་ ཀྱི་ འབྲས་བུ་ རྣམ་པར་ སྨིན་པ་ ལ་ སེམས་པ ར་ བྱེད་ དེ །_
en: $183 “Next, the monk who has knowledge of the ripening of the effects of karmic actions will examine the karmic ripening experienced by the asura ruler, Puṣpamāla.

source: དེས་ ཐོས་པ་ ལས་ བྱུང་བ འི་ ཤེས་པ ས་ བརྟགས་ ན །_ འདི་ལྟར་ སེམས་པ་ དང་ མི་ ལྡན་པ་ གང་ གིས་ ཚུལ་ཁྲིམས་ འཆལ་བ་ ལ་ ཟན་ གཅིག་ བྱིན་ ན་ ལས་ དེས་ ལྷ་མ་ ཡིན་ གྱི་ གནས་ ཟབ་པ ར་ ལྷ་མ་ ཡིན་ གྱི་ བདག་པོ་ བདུད་རྩི་ དྲི་མ་ ཅན་ ཟ་བ ར་ འགྱུར་བ་ མཐོང་ ངོ་ །_།
en: Inquiring with knowledge derived from hearing, he will notice that someone who inattentively offers a meal to people with corrupt discipline may be born as an asura ruler who consumes contaminated elixir in the asura site known as Profound.

source: དེ་ནས་ ཡང་ དགེ་སློང་ ལས་ ཀྱི་ འབྲས་བུ་ རྣམ་པར་ སྨིན་པ་ ཤེས་པ་ དེ་ ས་ གཞན་ བཞི་པ་ ལ་ རྟོག་པ ར་ བྱེད་ དེ །_
en: $184 “Next, the monk who has knowledge of the ripening of the effects of karmic actions will examine the fourth level of the asuras.

source: དེས་ ཐོས་པ་ ལས་ བྱུང་བ འི་ ཤེས་པ ས་ འདི་ལྟར་ དུད་འགྲོ ར་ གཏོགས་པ་ ལྷ་མ་ ཡིན་ གྱི་ གནས་ གཞན་ བཞི་པ་ མི་གཡོ་བ་ ཞེས་ བྱ་བ་ དཔག་ཚད་ ཉི་ཁྲི་ ཆིག་སྟོང་ ཡོད་པ་ མཐོང་ ངོ་ །_།
en: Through knowledge derived from hearing he will perceive this fourth level of the asuras, which is included in the animal realm, and is known as Immovable.

source: དེ འི་ དབུས་ ན་ གྲོང་ཁྱེར་ མཛེས་པ་ ཞེས་ བྱ་བ་ དཔག་ཚད་ བརྒྱད་ སྟོང་པ་ གཅིག་ ཡོད་ དོ །_།
en: This level extends twenty-one thousand leagues across, and in its center lies the city of Beauty, measuring eight thousand leagues.

source: གནས་ དེ་ཡང་ དཔག་ཚད་ ཁྲི་ སུམ་ སྟོང་ ཡོད་ དེ །_ གྲོང་ཁྱེར་ དེ་ ན་ ལྷ་མ་ ཡིན་ གྱི་ དབང་པོ་ རབ་ སྤྲོ་ ཞེས་ བྱ་བ་ གནས་ སོ །_།
en: The abode measures thirteen thousand leagues.#241 Within the city resides the asura king called Overjoyed.

source: གནས་ དེ་ ན་ ལྷ་མ་ ཡིན་ གནས་པ་ གང་ཡིན་པ་ དེ་དག་ གི་ མིང་ ནི་ ཀུན་ སྤྲོ་ ཞེས་ བྱ་ སྟེ །_
en: The asuras that inhabit this realm are known as the cheerful;

source: སྟོབས་ ཆེ་བ་ ཡིན་ ནོ །_། རྒྱལ་པོ་ དེ་ཡང་ ལྷ་མ་ ཡིན་ དེ་དག་ པས་ སྟོབས་ ཤིན་ཏུ་ ཆེ་བ་ ཡིན་ ཏེ །_
en: they have great powers, yet their king is far more powerful than they are.
